
// 실행 : F5 -> 단일 행 주석

// 변수(데이터를 저장할 수 있는 공간) 선언
string message = "안녕하세요";

Console.WriteLine("Hello, World!");

Console.WriteLine(message);

// ReadKey() : 콘솔 응용프로그램에서 키 입력을 기다릴 때 사용하는 메서드
Console.ReadKey();

/* 다중 행 주석
 * 
 * 클래스 - Console
 *  데이터(속성)과 기능(메서ㅍ드)를 하나의 틀로 묶어 놓은 구조
 *
 * 메서드 - WriteLine, ReadKey
 *  클래스 내에서 특정 동작이나 기능을 수행하는 코드 블록
 *  
 * 인수 - "Hello, World!"
 *  메서드가 실행될 때 필요한 데이터를 전달하기 위한 매개변수
 *  
 * 문자열(string)
 *  텍스트 데이터를 저장하고 조작하는 데 사용되는 데이터 형식
 *  
 * 선언
 *  변수, 메서드, 클래스 등 프로그래밍 요소를 정의하고 이름을 지정하는 과정
 *  
 * 디버깅
 *  프로그램에서 발생하는 오류나 버그를 찾아내고 수정하는 과정
 *
 * 단일 행 주석
 *  한 줄로 작성된 주석을 의미하며, 코드의 일부를 설명하거나 설명을 추가하는 용도로 사용
 * 
 * 다중 행 주석
 *  여러 줄에 걸쳐 주석을 작성할 때 사용
 *
 * 주석은 컴파일이 무시됨
 *
 * 컴파일
 *  1) 소스 코드를 컴퓨터가 실행할 수 있는 기계어로 변환하는 과정
 *  2) 소스 코드는 고수준 언어라서 컴퓨터가 이해할 수 없음 -> 컴퓨터가 이해할 수 있는 기계어로 
 *     변환하는 과정을 컴파일이라 함 
 */